#include <iostream>
#include <random>
#include <time.h>
using namespace std;

int main()
{
    setlocale(LC_ALL, "rus");
    /*int a, a1,b;
    
        cout << "Введите начало диапозона; ";
        cin >> a;
        cout << "Введите конец диапозона; ";
        cin >> a1;
        cout << "Введите число: ";
        cin >> b;
        for (; a > b || a1 < b; )
            {
              cout<<"Вы ввели число, которое не в диапозоне, повторите ввод; ";  
              cin >> b ;
            }
        cout << "Вы ввели число, которое входит в дипозон :)";
    Доработать
    /*int a = 11, a1 = 22, a2 = 33, a3 = 44, a4 = 55, b,b1,c=0,c1=0,c2=0,c3=0,c4=0,c5=0;
    cout << "Магазин \"БыСтРыЙ сАлАт\"\n";
    cout << "Скидка на Цезарь и Оливье 35%\n";
    cout << "Цены на товар: Царский - 50 р., Цезарь - 100 р., Селядь - 75 р., Оливье - 100 р., Мимоза - 125 р." << endl;
    cout << "Выберите товар из списка\nСалат \"Царский\" - 11\nСалат \"Цезарь\" - 22\nСалат \"Селядь под шубой\" - 33\nСалат \"Оливье\" - 44\nСалат \"Мимоза\" - 55 \n";
    cout << "Чтобы закончить введите 0"<<endl;
    cout << "Введите номер товара: ";
    cin >> b; 
    if (b == 0) {
        cout << "";
    }
    else {
        cout << "Введите количетсво товара: ";
        cin >> b1;
    }
    while (b != 0) {

        if (b == a) {
            c = 50 * b1;
        }
        else if (b == a1) { 
            c1 = 100 * b1*0.35; 
        }
        else if (b == a2) {
            c2 = 75 * b1;
        }
        else if (b == a3) {
            c3 = 100 * b1*0.35;
        }
        else if (b == a4) {
            c4 = 125 * b1;
        }
        else {
            cout << "Вы неправильно ввели номер товара\n";
        }
        cout << c << " " << c1 << " " << c2 << " " << c3 << " " << c4 << " " << c5 << " \n";
        c5 = c + c1 + c2 + c3 + c4;
        cout << "Введите номер товара: ";
        cin >> b;
        if (b == 0) {
            break;
        }
        else {
            cout << "Введите количетсво товара: ";
            cin >> b1;
        }
    }
    cout << "_--------------------------------_\n";
    cout << "Сумма покупки "<<c5<<" рубля(ей)";*/
    int a, a1,x,b,s,s1 = 0,s2 = 0,c = 0;
    cout << "Какую сложность выберите: легкая - 0, средняя - 1, сложная - 2 >>> ";
    cin >> b;
    while (c != 1) {

        switch (b) {
        case 0:
            x = 11;
            c = 1;
            break;
        case 1:
            x = 21;
            c = 1;
            break;
        case 2:
            x = 31;
            c = 1;
            break;
        default:
            cout << "Вы ввели неправильное значение сложности, повторите попытку: \n";
            cin >> b;
            break;
        }
    }
        switch (b) {
        case 0:
            cout << "Вы выбрали легкую сложность \n";
            break;
        case 1:
            cout << "Вы выбрали среднею сложность \n";
            break;
        case 2:
            cout << "Вы выбрали сложную сложность \n";
            break;
        }
        cout << "Чтобы остановить программу напишите 00\n";
        do {
            srand(time(NULL));
            a = rand() % x;
            a1 = rand() % x;
            cout << a << " * " << a1 << " = ";
            s = a * a1;
            cin >> s;
            if (s == a * a1) {
                cout << "Вы ответили правильно\n";
                s1++;
            }
            else if (s == 00){
                cout << "Остановка программы >>> \n";
                break;
            }
            else {
                cout << "Вы ответили неправильно\n";
                s2++;
            }
        } while (s != 00);
        printf("Правильных ответов %d и не правильных ответов %d ",s1,s2);
        return 0;
}
